blog/2022-12-03 My reading history in 2022.org
#+AUTHOR: Kinhung Lam
#+EMAIL: linjxljx@gmail.com
#+TITLE: My reading history in 2022
#+DATE: <2022-12-03 Sat 21:20>

  晚上看了 吴鲁加老师的 [[https://mp.weixin.qq.com/s/L6jw60lqdLqMCeDwKMfP8g][2021好书推荐]] ，就想着也可以记录下，于是就有了这篇文章哈。

2022年快过去了，想来今年也看了几本书，可以在这做个小结吧。近几年都比较少写年末总结，说来惭愧，每年年初的目标基本上没有完成。

近来我看的书，基本上包括了编程、投资、社科、教育等，我看得比较慢，所以每年基本上都只有几本。

** 工作相关：
#+begin_src text
《深入实践Spring Boot》
《Java 并发编程实践》，重读
《Java 并发编程艺术》，重读
《Python 核心编程》
《Activiti 实战》
《数据中台架构-企业》
《Learn GNU Emacs》
《计算机程序的构造与解释》
《黑客与画家》
《Build web application with Golang》
《Programming Clojure》
《Clojure Programming》
《白话区块链》
《深入理解 Java 虚拟机》，重读新版
《算法》
《代码未来》
《Rust 权限指南》
#+end_src text

** 投资：

#+begin_src text
- 《投资最重要的事》
- 《文明、现代化、价值投资与中国》，第三遍重读
- 《股票大作手回忆录》
- 《黑天鹅》
- 《随机漫步的傻瓜》
- 《异类：不一样的成功启示录》
- 《指数基金投资指南》
#+end_src text

** 社科文学：

#+begin_src text
- 《枪炮、病菌与钢铁》
- 《置身事内：中国政府与经济发展》
- 《底层逻辑》
#+end_src text

** 经济：

#+begin_src text
- 《宏观经济通识课》
#+end_src text

#+MORE_LINK:

** 其他：

#+begin_src text
- 《遇见孩子遇见更好的自己》
- 《读懂一本书：樊登读书法》
- 《你自以为的极限》
- 《从0到1：开启商业与未来的秘密》
- 《七年就是一辈子》
#+end_src text

** 极客时间的课程：

#+begin_src text
- 《超级访谈：对话毕玄》
- 《深入浅出区块链》
- 《如何成为学习高手》
- 《人人都用得上的数字化思维课》
- 《数据分析思维课》
- 《硅谷产品实战36讲》
- 《程序员的个人财富课》
- 《手机摄影》
- 《Go语言从入门到实践》
- 《Go语言核心36讲》
- 《说透中台》
- 《趣谈网络协议》
- 《从0开始学架构》
#+end_src text
