blog/2022-12-03 My reading history in 2022.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Sunday, December  4, 2022 at  5:01 PM -->
<meta charset="utf-8" />
<title>My reading history in 2022</title>
<meta name="author" content="Kinhung Lam" />
<meta name="generator" content="Org Mode" />
<meta name="twitter:site" content="@twylo" />
<meta name="twitter:creator" content="@twylo" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="me" href="https://weibo.com/u/2150445074" />
<link rel="icon" type="image/png" href="/images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="/images/icon/apple-touch-icon.png" />
<link rel="alternate" type="application/rss+xml" title="Weblog RSS Feed" href="/blog/rss.xml" />
<link rel="stylesheet" type="text/css" href="/res/faces.css">
<link rel="stylesheet" type="text/css" href="/res/style.css">
</head>
<body>
<div id="preamble" class="status">
<a class="skip-nav-link" href="#content">
  Skip navigation
</a>
<nav>
  <div class="navitem"><a href="/">Home</a></div>
  <div class="navitem"><a href="/blog/">Weblog</a></div>
  <div class="navitem"><a href="/portfolio/">Portfolio</a></div>
  <div class="navitem"><a href="/resume.html">Resume</a></div>
  <div class="navitem"><a href="/contact.html">Contact</a></div>
</nav>
<div class="published">
Published Saturday, December  3, 2022 at  9:20 PM
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">My reading history in 2022</h1>
</header><p>
晚上看了 吴鲁加老师的 <a href="https://mp.weixin.qq.com/s/L6jw60lqdLqMCeDwKMfP8g">2021好书推荐</a> ，就想着也可以记录下，于是就有了这篇文章哈。
</p>

<p>
2022年快过去了，想来今年也看了几本书，可以在这做个小结吧。近几年都比较少写年末总结，说来惭愧，每年年初的目标基本上没有完成。
</p>

<p>
近来我看的书，基本上包括了编程、投资、社科、教育等，我看得比较慢，所以每年基本上都只有几本。
</p>

<div id="outline-container-orgcea1af0" class="outline-2">
<h2 id="orgcea1af0">工作相关：</h2>
<div class="outline-text-2" id="text-orgcea1af0">
<p>
#+begin_src text
《深入实践Spring Boot》
《Java 并发编程实践》，重读
《Java 并发编程艺术》，重读
《Python 核心编程》
《Activiti 实战》
《数据中台架构-企业》
《Learn GNU Emacs》
《计算机程序的构造与解释》
《黑客与画家》
《Build web application with Golang》
《Programming Clojure》
《Clojure Programming》
《白话区块链》
《深入理解 Java 虚拟机》，重读新版
《算法》
《代码未来》
《Rust 权限指南》
#+end_src text
</p>
</div>
</div>

<div id="outline-container-org2d01ce3" class="outline-2">
<h2 id="org2d01ce3">投资：</h2>
<div class="outline-text-2" id="text-org2d01ce3">
<p>
#+begin_src text
</p>
<ul class="org-ul">
<li>《投资最重要的事》</li>
<li>《文明、现代化、价值投资与中国》，第三遍重读</li>
<li>《股票大作手回忆录》</li>
<li>《黑天鹅》</li>
<li>《随机漫步的傻瓜》</li>
<li>《异类：不一样的成功启示录》</li>
<li>《指数基金投资指南》</li>
</ul>
<p>
#+end_src text
</p>
</div>
</div>

<div id="outline-container-org5512d05" class="outline-2">
<h2 id="org5512d05">社科文学：</h2>
<div class="outline-text-2" id="text-org5512d05">
<p>
#+begin_src text
</p>
<ul class="org-ul">
<li>《枪炮、病菌与钢铁》</li>
<li>《置身事内：中国政府与经济发展》</li>
<li>《底层逻辑》</li>
</ul>
<p>
#+end_src text
</p>
</div>
</div>

<div id="outline-container-org362ca6f" class="outline-2">
<h2 id="org362ca6f">经济：</h2>
<div class="outline-text-2" id="text-org362ca6f">
<p>
#+begin_src text
</p>
<ul class="org-ul">
<li>《宏观经济通识课》</li>
</ul>
<p>
#+end_src text
</p>
</div>
</div>

<div id="outline-container-org356c841" class="outline-2">
<h2 id="org356c841">其他：</h2>
<div class="outline-text-2" id="text-org356c841">
<p>
#+begin_src text
</p>
<ul class="org-ul">
<li>《遇见孩子遇见更好的自己》</li>
<li>《读懂一本书：樊登读书法》</li>
<li>《你自以为的极限》</li>
<li>《从0到1：开启商业与未来的秘密》</li>
<li>《七年就是一辈子》</li>
</ul>
<p>
#+end_src text
</p>
</div>
</div>

<div id="outline-container-org1e31bd4" class="outline-2">
<h2 id="org1e31bd4">极客时间的课程：</h2>
<div class="outline-text-2" id="text-org1e31bd4">
<p>
#+begin_src text
</p>
<ul class="org-ul">
<li>《超级访谈：对话毕玄》</li>
<li>《深入浅出区块链》</li>
<li>《如何成为学习高手》</li>
<li>《人人都用得上的数字化思维课》</li>
<li>《数据分析思维课》</li>
<li>《硅谷产品实战36讲》</li>
<li>《程序员的个人财富课》</li>
<li>《手机摄影》</li>
<li>《Go语言从入门到实践》</li>
<li>《Go语言核心36讲》</li>
<li>《说透中台》</li>
<li>《趣谈网络协议》</li>
<li>《从0开始学架构》</li>
</ul>
<p>
#+end_src text
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer">
Proudly <a href="https://kinhung.me/blog/0110_emacs_blogging_for_fun_and_profit.html">published</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>. This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a> License. <a href="https://kinhung.me/privacy.html">Privacy Policy</a></div>
</div>
</body>
</html>
